turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm32/atdf/ATSAM4CMS32C_0.atdf
<?xml version="1.0" encoding="UTF-8"?>
<!-- ============================================================================ -->
<!--                  Atmel Microcontroller Software Support                      -->
<!--                       SAM Software Package License                           -->
<!-- ============================================================================ -->
<!-- Copyright (c) %copyright_year%, Atmel Corporation                                        -->
<!--                                                                              -->
<!-- All rights reserved.                                                         -->
<!--                                                                              -->
<!-- Redistribution and use in source and binary forms, with or without           -->
<!-- modification, are permitted provided that the following condition is met:    -->
<!--                                                                              -->
<!-- - Redistributions of source code must retain the above copyright notice,     -->
<!-- this list of conditions and the disclaimer below.                            -->
<!--                                                                              -->
<!-- Atmel's name may not be used to endorse or promote products derived from     -->
<!-- this software without specific prior written permission.                     -->
<!--                                                                              -->
<!-- DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR   -->
<!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF -->
<!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   -->
<!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      -->
<!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT -->
<!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  -->
<!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    -->
<!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         -->
<!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, -->
<!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           -->
<!-- ============================================================================ -->
<avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.6" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="ATSAM4CMS32C-AU" package="LQFP100" speedmax="120000000" tempmax="+85" tempmin="-40" vccmax="3.6" vccmin="1.62"/>
  </variants>
  <devices>
    <device architecture="CORTEX-M4" family="SAM4" name="ATSAM4CMS32C_0" series="SAM4CM">
      <address-spaces>
        <address-space id="base" name="base" endianness="little" size="0x100000000" start="0">
          <memory-segment name="PERIPHERALS" start="0x40000000" size="0x20000000" type="io"/>
          <memory-segment name="IFLASH0" start="0x01000000" size="0x00100000" type="flash" pagesize="512" mirror-mask="0x10000000"/>
          <memory-segment name="IFLASH1" start="0x01100000" size="0x00100000" type="flash" pagesize="512" mirror-mask="0x10000000"/>
          <memory-segment name="IROM" start="0x02000000" size="0x01000000" type="rom"/>
          <memory-segment name="IRAM0" start="0x20000000" size="0x00040000" type="ram"/>
          <memory-segment name="IRAM1" start="0x20080000" size="0x00008000" type="ram"/>
          <memory-segment name="IRAM2" start="0x20100000" size="0x00004000" type="ram"/>
          <memory-segment name="CPKCC_ROM" start="0x20180000" size="0x00010000" type="other"/>
          <memory-segment name="CPKCC_RAM" start="0x20191000" size="0x00001000" type="other"/>
          <memory-segment name="EBI_CS0" start="0x60000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS1" start="0x61000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS2" start="0x62000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
          <memory-segment name="EBI_CS3" start="0x63000000" size="0x01000000" type="other" mirror-mask="0x10000000"/>
        </address-space>
        <address-space id="fuses" name="fuses" endianness="little" size="1" start="0"/>
        <address-space id="lockbits" name="lockbits" endianness="little" size="0x20" start="0"/>
      </address-spaces>
      <peripherals>
        <module name="ADC" version="11250B">
          <instance name="ADC">
            <register-group address-space="base" name="ADC" name-in-module="ADC" offset="0x40038000"/>
            <signals>
              <signal pad="PA4" function="X1" group="COM" index="4"/>
              <signal pad="PA4" function="X1" group="AD" index="1"/>
              <signal pad="PA5" function="X1" group="COM" index="5"/>
              <signal pad="PA5" function="X1" group="AD" index="2"/>
              <signal pad="PA12" function="X1" group="SEG" index="6"/>
              <signal pad="PA12" function="X1" group="AD" index="0"/>
              <signal pad="PB13" function="X1" group="SEG" index="31"/>
              <signal pad="PB13" function="X1" group="AD" index="3"/>
            </signals>
          </instance>
        </module>
        <module name="AES" version="6149P">
          <instance name="AES">
            <register-group address-space="base" name="AES" name-in-module="AES" offset="0x40000000"/>
          </instance>
        </module>
        <module name="CHIPID" version="6417W">
          <instance name="CHIPID">
            <register-group address-space="base" name="CHIPID" name-in-module="CHIPID" offset="0x400E0740"/>
          </instance>
        </module>
        <module name="CMCC" version="11108D">
          <instance name="CMCC0">
            <register-group address-space="base" name="CMCC0" name-in-module="CMCC" offset="0x4007C000"/>
